Revit 2024 API
UnitTypeId.UsSurveyFeet Property
 US survey feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId UsSurveyFeet { get; }
Visual Basic
Public Shared ReadOnly Property UsSurveyFeet As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ UsSurveyFeet {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace